; (function () {
  'use strict';

  function sentences(count, separator) {
    if (!count) count = 2 + Math.floor(Math.random() * 4);
    if (!separator) separator = ' ';

    var result = '';

    for (var i = 0; i < count; i++) {
      if (i !== 0) result += separator;
      result += sentence();
    }

    return result;
  }

  var sentence = Phrase([
    function () { return 'Одна з ' + r('ведучих', 'найбільших', 'провідних') + ' ' + r('глобальних', 'міжнародних', 'світових') + ' ' + r('компаній', 'організацій') + ' ' + r('здійснює діяльність ' + r('за наступними напрямками', 'у наступних ' + r('галузях', 'сферах')) + ': ' + галузь() + ', ' + галузь() + ' та ' + галузь() + '', 'надає широкий спектр послуг, ' + r('а саме', 'зокрема') + ' ' + послугу() + ', ' + послугу() + ' та ' + послугу() + '') + '.'; },

    function () { return 'Завдяки ' + довершеним() + ' та ' + довершеним() + ' продуктам та послугам, ' + r('кваліфікованим', 'талановитим') + ' ' + r('працівникам', 'співробітникам') + ' і ' + r('відповідальному', 'серйозному') + ' ' + r('підходу', 'ставленню') + ' до ' + бізнесу() + ' та ' + бізнесу() + ', а також ' + r('кооперації', 'співпраці') + ' з ' + замовниками() + ' та ' + замовниками() + ', ' + компанія() + ' відкриває перед ' + r('світом', 'Україною') + ' нові ' + сучасні() + ' ' + r('можливості', 'перспективи') + '.'; },

    function () { return r('Мета ' + компанії(), 'Наша мета') + ' проста: це ' + r('забезпечення', 'надання') + ' вам ' + бізнесу() + ', ' + бізнесу() + ' та ' + бізнесу() + '.'; },

    function () { return r('Постійне', 'Систематичне', 'Тривале') + ' ' + r('вдосконалення', 'поліпшення') + ', ' + професіоналізм() + ', ' + професіоналізм() + ' та ' + професіоналізм() + ' забезпечили ' + компанії() + ' ' + r('визнання', 'успіх') + ' і провідну роль на ' + r('ринку України', 'світовому ринку') + '.'; },

    function () { return r('З ' + r(1998, 1999, 2000, 2001, 2002) + '-го року', 'На постійній основі', 'У своїй діяльності') + ' ' + компанія() + ' ' + r('використовує', 'застосовує') + ' ' + сучасні() + ' ' + сучасні() + ' ' + r('засоби', 'технології') + ' ' + бізнесу() + ', ' + бізнесу() + ' та ' + бізнесу() + '.'; },
  ]);

  var бізнесу = Phrase([
    'бізнесу',
    'відкриттів',
    'зберігання даних',
    'глобального громадянства',
    'накопичення',
    'неперервної інтеграції',
    'новаторства',
  ]);

  var галузь = Phrase([
    'кредити для малого та середнього бізнесу',
    'інформаційні технології',
    'мобільний голосовий зв\'язок',
    'підприємницька діяльність',
    'розробка програмного забезпечення',
    'телекомунікації',
  ]);

  var довершеним = Phrase([
    'довершеним',
    'інноваційним',
    'надійним',
    'прогресивним',
    'технологічним',
  ]);

  var замовниками = Phrase([
    'замовниками',
    'іноземними компаніями',
    'клієнтами',
    'нашими партнерами',
  ]);

  var компанії = Phrase([
    'компанії',
    'організації',
  ]);

  var компанія = Phrase([
    'компанія',
    'організація',
  ]);

  var послугу = Phrase([
    'кабельне телебачення',
    'пасажирські перевезення',
    'передачу даних',
    'послуги доставки кореспонденції',
    'юридичний захист ваших прав',
  ]);

  var професіоналізм = Phrase([
    function () { return r('досвідченість', 'професіоналізм') + ' ' + r('дружньої', 'злагодженої') + ' команди'; },
    function () { return r('збільшення', 'розширення') + ' ' + r('асортименту товарів', 'технічної бази'); },
    function () { return r('модернізація', 'розвиток') + ' сервісу'; },
    function () { return 'створення нових ' + r('товарних груп та відділів', 'торгових марок'); },
  ]);

  var сучасні = Phrase([
    'захоплюючі',
    'комп\'ютерні',
    'оригінальні',
    'сучасні',
    'універсальні',
  ]);

  // http://stackoverflow.com/a/6274398
  function shuffle(array) {
    let counter = array.length;

    while (counter > 0) {
      let index = Math.floor(Math.random() * counter);
      counter--;

      let temp = array[counter];
      array[counter] = array[index];
      array[index] = temp;
    }

    return array;
  }

  function Phrase(options) {
    var i = 0;
    options = shuffle(options.slice());

    return function () {
      var option = options[i];

      if (++i === options.length - 1) {
        i = 0;
        shuffle(options);
      }

      return (typeof option === 'function') ? option() : option;
    };
  }

  function r(xs) {
    if (arguments.length === 1) {
      return xs[Math.floor(Math.random() * xs.length)];
    } else {
      return arguments[Math.floor(Math.random() * arguments.length)];
    }
  }

  var fakerUk = {
    helpers: {
      Phrase: Phrase,
      randomize: r,
      shuffle: shuffle,
    },

    lorem: {
      sentence: sentence,
      sentences: sentences,
    },
  };

  if (typeof module !== 'undefined') {
    module.exports = fakerUk;
  }

  if (typeof window !== 'undefined') {
    window.fakerUk = fakerUk;
  }
})();
